app/views/sources/show.html.erb


        <% @source.items.each do |item| %>
---
SELECT "items".* FROM "items" WHERE ("items".source_id = 1)