app/views/authors/show.html.erb


        <% @author.items.each do |item| %>
---
SELECT "items".* FROM "items" WHERE ("items".author_id = 3)