app/controllers/categories_controller.rb

INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES ('Dogma', '2012-05-23 21:48:57.518106', '2012-05-23 21:48:57.518106')
---
  def create
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save

SELECT "categories".* FROM "categories" WHERE "categories"."id" = 7 LIMIT 1
UPDATE "categories" SET "name" = 'Cosas que pasan', "updated_at" = '2012-05-23 22:22:48.581525' WHERE "categories"."id" = 7
---
  def update
    @category = Category.find(params[:id])

    respond_to do |format|
      if @category.update_attributes(params[:category])