app/controllers/items_controller.rb

  def create
    @item = Item.new(params[:item])

    @item.category = Category.find_or_create_by_name(:name => params[:category][:name])
    @item.author = Author.find_or_create_by_name(params[:author][:name])
    @item.source = Source.find_or_create_by_name(:name => params[:source][:name], :url => get_domain_from_url(params[:item][:url]))
    @item.user = current_user

    respond_to do |format|
      if @item.save
---
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES ('', '2012-05-23 22:19:08.510525', '2012-05-23 22:19:08.510525')
INSERT INTO "items" ("title", "url", "excerpt", "published_at", "created_at", "updated_at", "author_id", "source_id", "category_id", "user_id") VALUES ('This is a bug', 'http://google.com', 'The surface is fine and powdery. I can kick it up loosely with my toe. It does adhere in fine layers, like powdered charcoal, to the sole and sides of my boots. I only go in a small fraction of an inch, maybe an eighth of an inch, but I can see the footprints of my boots and the treads in the fine, sandy particles. There seems to be no difficult in moving around, as we suspected.', '2012-05-23 20:42:00.000000', '2012-05-23 21:04:14.809862', '2012-05-23 21:04:14.809862', 1, 1, 1, 1)
SELECT "categories".* FROM "categories" WHERE "categories"."name" = 'Dissapointment' LIMIT 1
INSERT INTO "authors" ("name", "url", "created_at", "updated_at") VALUES ('Fernando Palma', NULL, '2012-05-23 22:19:22.468525', '2012-05-23 22:19:22.468525')
SELECT "authors"."id" FROM "authors" WHERE ("authors"."name" = 'Fernando Plata') LIMIT 1
INSERT INTO "sources" ("name", "url", "created_at", "updated_at") VALUES ('Yahoo', NULL, '2012-05-23 23:40:34.580710', '2012-05-23 23:40:34.580710')
SELECT "sources"."id" FROM "sources" WHERE ("sources"."name" = 'Yahoo') LIMIT 1
UPDATE "users" SET "last_request_at" = '2012-05-24 23:10:24.195396', "updated_at" = '2012-05-24 23:10:24.196396' WHERE "users"."id" = 1