app/controllers/sources_controller.rb

  def index
    @sources = Source.all
---
SELECT "sources".* FROM "sources"

  def show
    @source = Source.find(params[:id])
---
SELECT "sources".* FROM "sources" WHERE "sources"."id" = 4 LIMIT 1

  def edit
    @source = Source.find(params[:id])
---
SELECT "sources".* FROM "sources" WHERE "sources"."id" = 4 LIMIT 1

  def update
    @source = Source.find(params[:id])

    respond_to do |format|
      if @source.update_attributes(params[:source])
---
SELECT "sources".* FROM "sources" WHERE "sources"."id" = 4 LIMIT 1
UPDATE "sources" SET "url" = 'http://ny.com', "updated_at" = '2012-05-23 23:40:57.989133' WHERE "sources"."id" = 4