app/controllers/submitted_items_controller.rb

  def create
    @item = SubmittedItem.new(params[:submitted_item])

    @item.user = current_user
    #@submitted.published? = false

    if @item.save
---
INSERT INTO "submitted_items" ("url", "published", "updated_at", "user_id", "created_at") VALUES ('http://google.com', NULL, '2012-05-24 05:53:08.044798', 1, '2012-05-24 05:53:08.044798')