app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "crypted_password", "password_salt", "persistence_token", "login_count", "failed_login_count", "last_request_at", "current_login_at", "last_login_at", "current_login_ip", "last_login_ip", "created_at", "updated_at") VALUES ('ojcar', 'orm84@yahoo.com', 'e140252ecd2cdd36c1a93a0005add46eef5de335c8e6b1379a5e40c641a037eda73c8faddb6ee136887802593703a75902fda835a985327ce34c29c07bcd22f9', 'YCzwwmOEVqqrUjDXtRTo', '6160c0c6499ad4df6bc62e690e38904e536ce1cd3c2556bcb5255c873a6627d6291468d9791e4190bc612549f2b6545cf8866ff767a01f77b27dd980fcf0d39d', 1, 0, '2012-05-23 23:48:30.799410', '2012-05-23 23:48:30.799410', NULL, '127.0.0.1', NULL, '2012-05-23 23:48:30.800410', '2012-05-23 23:48:30.800410')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save